---
kind: other
id: Properties.T:Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings
source: html/bb829e0c-6ef5-9414-6379-b2023dc4f95b.htm
---
# AnalysisDisplayMarkersAndTextSettings Properties

Specifies whether the .NET object represents a valid Revit entity.